C:\Anaconda2\envs\deeplearning\python.exe C:/Dev/conditional-image-generation/convolution.py
Using Theano backend.
Using cuDNN version 5110 on context None
Mapped name None to device cuda: GeForce GTX 1070 (0000:01:00.0)
.....................................................x...............................s...................................x....................................s........ss.ss..................ss..................................................................................sss..............................................................x....x........................x.....x......................................ssssssssss...............
----------------------------------------------------------------------
Ran 439 tests in 1.384s

OK (skipped=21, expected failures=6)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 64, 64, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 64, 16)        448       
_________________________________________________________________
activation_1 (Activation)    (None, 64, 64, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 16)        2320      
_________________________________________________________________
activation_2 (Activation)    (None, 64, 64, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 32)        4640      
_________________________________________________________________
activation_3 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
activation_4 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 64)        18496     
_________________________________________________________________
activation_5 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 64)        36928     
_________________________________________________________________
activation_6 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 32, 32, 32)        18464     
_________________________________________________________________
activation_7 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
activation_8 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 64, 64, 16)        4624      
_________________________________________________________________
activation_9 (Activation)    (None, 64, 64, 16)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 64, 64, 16)        2320      
_________________________________________________________________
activation_10 (Activation)   (None, 64, 64, 16)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 64, 3)         435       
=================================================================
Total params: 107,171
Trainable params: 107,171
Non-trainable params: 0
_________________________________________________________________
Train on 82611 samples, validate on 40438 samples
Epoch 1/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5889 - acc: 0.0207Epoch 00000: val_loss improved from inf to 0.56670, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5889 - acc: 0.0207 - val_loss: 0.5667 - val_acc: 0.0214
Epoch 2/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5651 - acc: 0.0215Epoch 00001: val_loss improved from 0.56670 to 0.56485, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5651 - acc: 0.0215 - val_loss: 0.5648 - val_acc: 0.0215
Epoch 3/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5611 - acc: 0.0215Epoch 00002: val_loss improved from 0.56485 to 0.55930, saving model to ./weights.hdf5
82611/82611 [==============================] - 595s - loss: 0.5611 - acc: 0.0215 - val_loss: 0.5593 - val_acc: 0.0215
Epoch 4/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5593 - acc: 0.0215Epoch 00003: val_loss improved from 0.55930 to 0.55777, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5593 - acc: 0.0215 - val_loss: 0.5578 - val_acc: 0.0215
Epoch 5/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5579 - acc: 0.0215Epoch 00004: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5579 - acc: 0.0215 - val_loss: 0.5580 - val_acc: 0.0215
Epoch 6/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5572 - acc: 0.0216Epoch 00005: val_loss improved from 0.55777 to 0.55600, saving model to ./weights.hdf5
82611/82611 [==============================] - 595s - loss: 0.5572 - acc: 0.0216 - val_loss: 0.5560 - val_acc: 0.0215
Epoch 7/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5563 - acc: 0.0216Epoch 00006: val_loss improved from 0.55600 to 0.55534, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5563 - acc: 0.0216 - val_loss: 0.5553 - val_acc: 0.0215
Epoch 8/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5560 - acc: 0.0216Epoch 00007: val_loss improved from 0.55534 to 0.55490, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5560 - acc: 0.0216 - val_loss: 0.5549 - val_acc: 0.0215
Epoch 9/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5552 - acc: 0.0216Epoch 00008: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5552 - acc: 0.0216 - val_loss: 0.5566 - val_acc: 0.0215
Epoch 10/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5551 - acc: 0.0216Epoch 00009: val_loss improved from 0.55490 to 0.55426, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5551 - acc: 0.0216 - val_loss: 0.5543 - val_acc: 0.0215
Epoch 11/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5546 - acc: 0.0216Epoch 00010: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5546 - acc: 0.0216 - val_loss: 0.5553 - val_acc: 0.0216
Epoch 12/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5541 - acc: 0.0216Epoch 00011: val_loss improved from 0.55426 to 0.55355, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5541 - acc: 0.0216 - val_loss: 0.5536 - val_acc: 0.0216
Epoch 13/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5539 - acc: 0.0216Epoch 00012: val_loss improved from 0.55355 to 0.55315, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5539 - acc: 0.0216 - val_loss: 0.5532 - val_acc: 0.0216
Epoch 14/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5535 - acc: 0.0216Epoch 00013: val_loss improved from 0.55315 to 0.55278, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5535 - acc: 0.0216 - val_loss: 0.5528 - val_acc: 0.0216
Epoch 15/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5532 - acc: 0.0216Epoch 00014: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5532 - acc: 0.0216 - val_loss: 0.5532 - val_acc: 0.0216
Epoch 16/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5531 - acc: 0.0216Epoch 00015: val_loss improved from 0.55278 to 0.55277, saving model to ./weights.hdf5
82611/82611 [==============================] - 595s - loss: 0.5531 - acc: 0.0216 - val_loss: 0.5528 - val_acc: 0.0216
Epoch 17/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5527 - acc: 0.0216Epoch 00016: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5527 - acc: 0.0216 - val_loss: 0.5529 - val_acc: 0.0216
Epoch 18/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5524 - acc: 0.0216Epoch 00017: val_loss improved from 0.55277 to 0.55205, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5524 - acc: 0.0216 - val_loss: 0.5521 - val_acc: 0.0216
Epoch 19/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5522 - acc: 0.0216Epoch 00018: val_loss improved from 0.55205 to 0.55170, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5522 - acc: 0.0216 - val_loss: 0.5517 - val_acc: 0.0216
Epoch 20/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5520 - acc: 0.0216Epoch 00019: val_loss improved from 0.55170 to 0.55137, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5520 - acc: 0.0216 - val_loss: 0.5514 - val_acc: 0.0216
Epoch 21/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5520 - acc: 0.0216Epoch 00020: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5520 - acc: 0.0216 - val_loss: 0.5522 - val_acc: 0.0216
Epoch 22/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5516 - acc: 0.0216Epoch 00021: val_loss improved from 0.55137 to 0.55103, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5516 - acc: 0.0216 - val_loss: 0.5510 - val_acc: 0.0216
Epoch 23/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5516 - acc: 0.0216Epoch 00022: val_loss improved from 0.55103 to 0.55101, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5516 - acc: 0.0216 - val_loss: 0.5510 - val_acc: 0.0216
Epoch 24/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5514 - acc: 0.0216Epoch 00023: val_loss improved from 0.55101 to 0.55085, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5514 - acc: 0.0216 - val_loss: 0.5508 - val_acc: 0.0216
Epoch 25/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5512 - acc: 0.0216Epoch 00024: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5512 - acc: 0.0216 - val_loss: 0.5509 - val_acc: 0.0216
Epoch 26/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5511 - acc: 0.0216Epoch 00025: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5511 - acc: 0.0216 - val_loss: 0.5510 - val_acc: 0.0216
Epoch 27/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5510 - acc: 0.0216Epoch 00026: val_loss improved from 0.55085 to 0.55038, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5510 - acc: 0.0216 - val_loss: 0.5504 - val_acc: 0.0216
Epoch 28/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5507 - acc: 0.0216Epoch 00027: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5507 - acc: 0.0216 - val_loss: 0.5505 - val_acc: 0.0216
Epoch 29/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5507 - acc: 0.0216Epoch 00028: val_loss improved from 0.55038 to 0.55010, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5507 - acc: 0.0216 - val_loss: 0.5501 - val_acc: 0.0216
Epoch 30/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5505 - acc: 0.0216Epoch 00029: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5505 - acc: 0.0216 - val_loss: 0.5501 - val_acc: 0.0216
Epoch 31/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5504 - acc: 0.0216Epoch 00030: val_loss improved from 0.55010 to 0.55001, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5504 - acc: 0.0216 - val_loss: 0.5500 - val_acc: 0.0216
Epoch 32/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5502 - acc: 0.0216Epoch 00031: val_loss improved from 0.55001 to 0.54998, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5502 - acc: 0.0216 - val_loss: 0.5500 - val_acc: 0.0216
Epoch 33/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5503 - acc: 0.0216Epoch 00032: val_loss improved from 0.54998 to 0.54992, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5503 - acc: 0.0216 - val_loss: 0.5499 - val_acc: 0.0216
Epoch 34/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5501 - acc: 0.0216Epoch 00033: val_loss improved from 0.54992 to 0.54953, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5501 - acc: 0.0216 - val_loss: 0.5495 - val_acc: 0.0216
Epoch 35/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5499 - acc: 0.0216Epoch 00034: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5499 - acc: 0.0216 - val_loss: 0.5496 - val_acc: 0.0216
Epoch 36/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5500 - acc: 0.0216Epoch 00035: val_loss improved from 0.54953 to 0.54950, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5500 - acc: 0.0216 - val_loss: 0.5495 - val_acc: 0.0216
Epoch 37/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5498 - acc: 0.0216Epoch 00036: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5499 - acc: 0.0216 - val_loss: 0.5509 - val_acc: 0.0216
Epoch 38/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5498 - acc: 0.0216Epoch 00037: val_loss improved from 0.54950 to 0.54945, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5498 - acc: 0.0216 - val_loss: 0.5495 - val_acc: 0.0216
Epoch 39/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5497 - acc: 0.0216Epoch 00038: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5497 - acc: 0.0216 - val_loss: 0.5496 - val_acc: 0.0216
Epoch 40/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5496 - acc: 0.0216Epoch 00039: val_loss did not improve
82611/82611 [==============================] - 595s - loss: 0.5496 - acc: 0.0216 - val_loss: 0.5506 - val_acc: 0.0216
Epoch 41/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5495 - acc: 0.0216Epoch 00040: val_loss improved from 0.54945 to 0.54907, saving model to ./weights.hdf5
82611/82611 [==============================] - 595s - loss: 0.5495 - acc: 0.0216 - val_loss: 0.5491 - val_acc: 0.0216
Epoch 42/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5494 - acc: 0.0216Epoch 00041: val_loss did not improve
82611/82611 [==============================] - 595s - loss: 0.5494 - acc: 0.0216 - val_loss: 0.5491 - val_acc: 0.0216
Epoch 43/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5494 - acc: 0.0216Epoch 00042: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5494 - acc: 0.0216 - val_loss: 0.5492 - val_acc: 0.0216
Epoch 44/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5493 - acc: 0.0216Epoch 00043: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5493 - acc: 0.0216 - val_loss: 0.5504 - val_acc: 0.0216
Epoch 45/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5492 - acc: 0.0216Epoch 00044: val_loss improved from 0.54907 to 0.54896, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5492 - acc: 0.0216 - val_loss: 0.5490 - val_acc: 0.0216
Epoch 46/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5492 - acc: 0.0216Epoch 00045: val_loss improved from 0.54896 to 0.54876, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5492 - acc: 0.0216 - val_loss: 0.5488 - val_acc: 0.0216
Epoch 47/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5491 - acc: 0.0216Epoch 00046: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5491 - acc: 0.0216 - val_loss: 0.5492 - val_acc: 0.0216
Epoch 48/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5490 - acc: 0.0216Epoch 00047: val_loss improved from 0.54876 to 0.54872, saving model to ./weights.hdf5
82611/82611 [==============================] - 595s - loss: 0.5490 - acc: 0.0216 - val_loss: 0.5487 - val_acc: 0.0216
Epoch 49/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5490 - acc: 0.0216Epoch 00048: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5490 - acc: 0.0216 - val_loss: 0.5488 - val_acc: 0.0216
Epoch 50/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5489 - acc: 0.0216Epoch 00049: val_loss did not improve
82611/82611 [==============================] - 595s - loss: 0.5489 - acc: 0.0216 - val_loss: 0.5491 - val_acc: 0.0216
Epoch 51/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5488 - acc: 0.0216Epoch 00050: val_loss improved from 0.54872 to 0.54858, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5488 - acc: 0.0216 - val_loss: 0.5486 - val_acc: 0.0216
Epoch 52/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5488 - acc: 0.0216Epoch 00051: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5488 - acc: 0.0216 - val_loss: 0.5487 - val_acc: 0.0216
Epoch 53/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5488 - acc: 0.0216Epoch 00052: val_loss improved from 0.54858 to 0.54837, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5488 - acc: 0.0216 - val_loss: 0.5484 - val_acc: 0.0216
Epoch 54/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5487 - acc: 0.0216Epoch 00053: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5487 - acc: 0.0216 - val_loss: 0.5484 - val_acc: 0.0216
Epoch 55/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5486 - acc: 0.0216Epoch 00054: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5486 - acc: 0.0216 - val_loss: 0.5485 - val_acc: 0.0216
Epoch 56/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5486 - acc: 0.0216Epoch 00055: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5486 - acc: 0.0216 - val_loss: 0.5488 - val_acc: 0.0216
Epoch 57/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5485 - acc: 0.0216Epoch 00056: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5485 - acc: 0.0216 - val_loss: 0.5508 - val_acc: 0.0216
Epoch 58/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5486 - acc: 0.0216Epoch 00057: val_loss improved from 0.54837 to 0.54827, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5486 - acc: 0.0216 - val_loss: 0.5483 - val_acc: 0.0216
Epoch 59/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5484 - acc: 0.0216Epoch 00058: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5484 - acc: 0.0216 - val_loss: 0.5483 - val_acc: 0.0216
Epoch 60/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5485 - acc: 0.0216Epoch 00059: val_loss improved from 0.54827 to 0.54822, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5485 - acc: 0.0216 - val_loss: 0.5482 - val_acc: 0.0216
Epoch 61/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5484 - acc: 0.0216Epoch 00060: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5484 - acc: 0.0216 - val_loss: 0.5483 - val_acc: 0.0216
Epoch 62/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5484 - acc: 0.0216Epoch 00061: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5484 - acc: 0.0216 - val_loss: 0.5487 - val_acc: 0.0216
Epoch 63/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5483 - acc: 0.0216Epoch 00062: val_loss improved from 0.54822 to 0.54818, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5483 - acc: 0.0216 - val_loss: 0.5482 - val_acc: 0.0216
Epoch 64/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5483 - acc: 0.0216Epoch 00063: val_loss improved from 0.54818 to 0.54797, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5483 - acc: 0.0216 - val_loss: 0.5480 - val_acc: 0.0216
Epoch 65/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5483 - acc: 0.0216Epoch 00064: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5483 - acc: 0.0216 - val_loss: 0.5480 - val_acc: 0.0216
Epoch 66/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5483 - acc: 0.0216Epoch 00065: val_loss improved from 0.54797 to 0.54792, saving model to ./weights.hdf5
82611/82611 [==============================] - 592s - loss: 0.5482 - acc: 0.0216 - val_loss: 0.5479 - val_acc: 0.0216
Epoch 67/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5482 - acc: 0.0216Epoch 00066: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5482 - acc: 0.0216 - val_loss: 0.5481 - val_acc: 0.0216
Epoch 68/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5481 - acc: 0.0216Epoch 00067: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5481 - acc: 0.0216 - val_loss: 0.5481 - val_acc: 0.0216
Epoch 69/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5481 - acc: 0.0216Epoch 00068: val_loss improved from 0.54792 to 0.54787, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5481 - acc: 0.0216 - val_loss: 0.5479 - val_acc: 0.0216
Epoch 70/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5481 - acc: 0.0216Epoch 00069: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5481 - acc: 0.0216 - val_loss: 0.5483 - val_acc: 0.0216
Epoch 71/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5480 - acc: 0.0216Epoch 00070: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5480 - acc: 0.0216 - val_loss: 0.5479 - val_acc: 0.0216
Epoch 72/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5480 - acc: 0.0216Epoch 00071: val_loss improved from 0.54787 to 0.54786, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5480 - acc: 0.0216 - val_loss: 0.5479 - val_acc: 0.0216
Epoch 73/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5480 - acc: 0.0216Epoch 00072: val_loss improved from 0.54786 to 0.54785, saving model to ./weights.hdf5
82611/82611 [==============================] - 594s - loss: 0.5480 - acc: 0.0216 - val_loss: 0.5478 - val_acc: 0.0216
Epoch 74/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5480 - acc: 0.0216Epoch 00073: val_loss improved from 0.54785 to 0.54773, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5480 - acc: 0.0216 - val_loss: 0.5477 - val_acc: 0.0216
Epoch 75/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5479 - acc: 0.0216Epoch 00074: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5479 - acc: 0.0216 - val_loss: 0.5484 - val_acc: 0.0216
Epoch 76/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5479 - acc: 0.0216Epoch 00075: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5479 - acc: 0.0216 - val_loss: 0.5480 - val_acc: 0.0216
Epoch 77/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5479 - acc: 0.0216Epoch 00076: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5479 - acc: 0.0216 - val_loss: 0.5493 - val_acc: 0.0216
Epoch 78/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5478 - acc: 0.0216Epoch 00077: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5478 - acc: 0.0216 - val_loss: 0.5477 - val_acc: 0.0216
Epoch 79/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5478 - acc: 0.0216Epoch 00078: val_loss improved from 0.54773 to 0.54754, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5478 - acc: 0.0216 - val_loss: 0.5475 - val_acc: 0.0216
Epoch 80/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5479 - acc: 0.0216Epoch 00079: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5479 - acc: 0.0216 - val_loss: 0.5481 - val_acc: 0.0216
Epoch 81/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5477 - acc: 0.0216Epoch 00080: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5477 - acc: 0.0216 - val_loss: 0.5480 - val_acc: 0.0216
Epoch 82/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5477 - acc: 0.0216Epoch 00081: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5477 - acc: 0.0216 - val_loss: 0.5479 - val_acc: 0.0216
Epoch 83/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5477 - acc: 0.0216Epoch 00082: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5477 - acc: 0.0216 - val_loss: 0.5482 - val_acc: 0.0216
Epoch 84/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5478 - acc: 0.0216Epoch 00083: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5478 - acc: 0.0216 - val_loss: 0.5483 - val_acc: 0.0216
Epoch 85/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5477 - acc: 0.0216Epoch 00084: val_loss improved from 0.54754 to 0.54746, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5477 - acc: 0.0216 - val_loss: 0.5475 - val_acc: 0.0216
Epoch 86/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5476 - acc: 0.0216Epoch 00085: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5483 - val_acc: 0.0216
Epoch 87/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5476 - acc: 0.0216Epoch 00086: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5477 - val_acc: 0.0216
Epoch 88/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5476 - acc: 0.0216Epoch 00087: val_loss improved from 0.54746 to 0.54741, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5474 - val_acc: 0.0216
Epoch 89/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5476 - acc: 0.0216Epoch 00088: val_loss improved from 0.54741 to 0.54734, saving model to ./weights.hdf5
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5473 - val_acc: 0.0216
Epoch 90/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5476 - acc: 0.0216Epoch 00089: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5477 - val_acc: 0.0216
Epoch 91/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5475 - acc: 0.0216Epoch 00090: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5484 - val_acc: 0.0216
Epoch 92/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5475 - acc: 0.0216Epoch 00091: val_loss did not improve
82611/82611 [==============================] - 592s - loss: 0.5475 - acc: 0.0216 - val_loss: 0.5478 - val_acc: 0.0216
Epoch 93/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5476 - acc: 0.0216Epoch 00092: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5476 - acc: 0.0216 - val_loss: 0.5474 - val_acc: 0.0216
Epoch 94/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5475 - acc: 0.0216Epoch 00093: val_loss did not improve
82611/82611 [==============================] - 594s - loss: 0.5475 - acc: 0.0216 - val_loss: 0.5476 - val_acc: 0.0216
Epoch 95/100
82500/82611 [============================>.] - ETA: 0s - loss: 0.5474 - acc: 0.0216Epoch 00094: val_loss did not improve
82611/82611 [==============================] - 593s - loss: 0.5474 - acc: 0.0216 - val_loss: 0.5474 - val_acc: 0.0216
['acc', 'loss', 'val_acc', 'val_loss']

Process finished with exit code 0