C:\Anaconda2\envs\deeplearning\python.exe C:/Dev/conditional-image-generation/convolution.py
Using Theano backend.
Using cuDNN version 5110 on context None
Mapped name None to device cuda: GeForce GTX 1070 (0000:01:00.0)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 64, 64, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 64, 16)        448       
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 64, 16)        64        
_________________________________________________________________
activation_1 (Activation)    (None, 64, 64, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)        4640      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 32)        128       
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 64)        18496     
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 32, 32)        18464     
_________________________________________________________________
batch_normalization_5 (Batch (None, 32, 32, 32)        128       
_________________________________________________________________
activation_5 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 64, 64, 32)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 16)        4624      
_________________________________________________________________
batch_normalization_6 (Batch (None, 64, 64, 16)        64        
_________________________________________________________________
activation_6 (Activation)    (None, 64, 64, 16)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 3)         435       
=================================================================
Total params: 84,931
Trainable params: 84,483
Non-trainable params: 448
_________________________________________________________________
Train on 82611 samples, validate on 40438 samples
Epoch 1/100
82611/82611 [==============================] - 2257s - loss: 0.5924 - acc: 0.0208 - val_loss: 0.6995 - val_acc: 0.0202
Epoch 2/100
82611/82611 [==============================] - 2260s - loss: 0.5735 - acc: 0.0213 - val_loss: 0.6169 - val_acc: 0.0211
Epoch 3/100
82611/82611 [==============================] - 2266s - loss: 0.5703 - acc: 0.0214 - val_loss: 0.5980 - val_acc: 0.0212
Epoch 4/100
82611/82611 [==============================] - 2256s - loss: 0.5684 - acc: 0.0214 - val_loss: 0.5975 - val_acc: 0.0212
Epoch 5/100
82611/82611 [==============================] - 2257s - loss: 0.5673 - acc: 0.0214 - val_loss: 0.5885 - val_acc: 0.0213
Epoch 6/100
82611/82611 [==============================] - 2255s - loss: 0.5665 - acc: 0.0214 - val_loss: 0.5873 - val_acc: 0.0213
Epoch 7/100
82611/82611 [==============================] - 2267s - loss: 0.5658 - acc: 0.0214 - val_loss: 0.5812 - val_acc: 0.0213
Epoch 8/100
82611/82611 [==============================] - 2260s - loss: 0.5652 - acc: 0.0215 - val_loss: 0.5872 - val_acc: 0.0213
Epoch 9/100
82611/82611 [==============================] - 2263s - loss: 0.5649 - acc: 0.0215 - val_loss: 0.5784 - val_acc: 0.0213
Epoch 10/100
82611/82611 [==============================] - 2257s - loss: 0.5645 - acc: 0.0215 - val_loss: 0.5784 - val_acc: 0.0213
Epoch 11/100
82611/82611 [==============================] - 2255s - loss: 0.5642 - acc: 0.0215 - val_loss: 0.5752 - val_acc: 0.0214
Epoch 12/100
82611/82611 [==============================] - 2255s - loss: 0.5639 - acc: 0.0215 - val_loss: 0.5724 - val_acc: 0.0214
Epoch 13/100
82611/82611 [==============================] - 2262s - loss: 0.5638 - acc: 0.0215 - val_loss: 0.5767 - val_acc: 0.0213
Epoch 14/100
82611/82611 [==============================] - 2261s - loss: 0.5635 - acc: 0.0215 - val_loss: 0.5795 - val_acc: 0.0213
Epoch 15/100
82611/82611 [==============================] - 2263s - loss: 0.5634 - acc: 0.0215 - val_loss: 0.5810 - val_acc: 0.0213
Epoch 16/100
82611/82611 [==============================] - 2261s - loss: 0.5632 - acc: 0.0215 - val_loss: 0.5800 - val_acc: 0.0213
['acc', 'loss', 'val_acc', 'val_loss']

Process finished with exit code 0